EDT/УТ/src/Catalogs/ПланыВыгрузкиДанныхВБухгалтерию/ПланыВыгрузкиДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыВыгрузкиДанныхВБухгалтерию</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПоступлениеТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОтчетОРозничныхПродажах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОперациюВведеннуюВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаТоваров</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКассы</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПКО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаОтчетОРозничныхПродажах</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОперацииВведеннойВручную</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьОбъектыБухгалтерииПриОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтатьиДДС</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСтатьиДДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляНаличныхРасчетовИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьСкладВПроводку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменМеждуСвоимиЮрлицами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыОплат</name>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварПривязанККонтрагенту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТипаОплаты</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТипаОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/ПланыВыгрузкиДанныхВБухгалтерию/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ИсточникДанных");
	ПроверяемыеРеквизиты.Добавить("Организация");
	
	Если  ЭтотОбъект.СоздаватьПоступлениеТоваров 
		ИЛИ ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаТоваров");		
	КонецЕсли;
	
	Если  ЭтотОбъект.СоздаватьПКО 
		ИЛИ ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаКассы");
		ПроверяемыеРеквизиты.Добавить("ИдентификаторСтатьиДДС");
	КонецЕсли;
	
	Если ЭтотОбъект.СоздаватьПоступлениеТоваров Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаПоступления");
		ПроверяемыеРеквизиты.Добавить("СчетУчетаВзаиморасчетов");
	КонецЕсли;

	Если ЭтотОбъект.СоздаватьПКО Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаПКО");
	КонецЕсли;

	Если ЭтотОбъект.СоздаватьОтчетОРозничныхПродажах Тогда
		
		ПроверяемыеРеквизиты.Добавить("СчетУчетаДоходов");
		ПроверяемыеРеквизиты.Добавить("СчетУчетаРасходов");
		ПроверяемыеРеквизиты.Добавить("ВремяДокументаОтчетОРозничныхПродажах");	
		ПроверяемыеРеквизиты.Добавить("СчетУчетаНДС");	

	КонецЕсли;
	
	Если ЭтотОбъект.СоздаватьОперациюВведеннуюВручную Тогда
		ПроверяемыеРеквизиты.Добавить("ВремяОперацииВведеннойВручную");
		ПроверяемыеРеквизиты.Добавить("ОрганизацияДляНаличныхРасчетовИНН");
	КонецЕсли;

КонецПроцедуры
